function [Time_M,Time_m,xx,TT,Time_v,Time_vh] = timeline(m,n,ultra_age)
% 創造出主架構的時間軸
% Time_M: 「各投保年齡下的年齡矩陣」，給q使用(因為q和年齡有關)
% Time_m:  對Coupon來說，為期初，對TGP來說為期間
% xx:     「投保年齡」的矩陣形態
% TT:     「保單年度」的矩陣形態
% Time_v:  每個期間(期未到期初)的折現參數，即v的power。
% Time_vh: 每個期間(期中到期初)的折現參數，即v的half power。

% %{
% =>Example
% 	octave:62> [Time_M,Time_m,xx,TT,Time_v,Time_vh] = timeline(2,2,4)
% 	Time_M =
% 	0    1    2    3    4    5    6
% 	0    1    2    3    4    5    6
% 	1    2    3    4    5    6    7
% 	1    2    3    4    5    6    7
% 	2    3    4    5    6    7    8
% 	3    4    5    6    7    8    9
% 	4    5    6    7    8    9   10
% 	Time_m =
% 	1   1   1   1   1   1   1
% 	2   2   2   2   2   2   0
% 	1   1   1   1   1   0   0
% 	2   2   2   2   0   0   0
% 	1   1   1   0   0   0   0
% 	1   1   0   0   0   0   0
% 	1   0   0   0   0   0   0
% 	xx =
% 	0   1   2   3   4   5   6
% 	0   1   2   3   4   5   6
% 	0   1   2   3   4   5   6
% 	0   1   2   3   4   5   6
% 	0   1   2   3   4   5   6
% 	0   1   2   3   4   5   6
% 	0   1   2   3   4   5   6
% 	TT =
% 	0   0   0   0   0   0   0
% 	0   0   0   0   0   0   0
% 	1   1   1   1   1   1   1
% 	1   1   1   1   1   1   1
% 	2   2   2   2   2   2   2
% 	3   3   3   3   3   3   3
% 	4   4   4   4   4   4   4
% 	Time_v =
% 	0.50000   0.50000   0.50000   0.50000   0.50000   0.50000   0.50000
% 	1.00000   1.00000   1.00000   1.00000   1.00000   1.00000   1.00000
% 	1.50000   1.50000   1.50000   1.50000   1.50000   1.50000   1.50000
% 	2.00000   2.00000   2.00000   2.00000   2.00000   2.00000   2.00000
% 	3.00000   3.00000   3.00000   3.00000   3.00000   3.00000   3.00000
% 	4.00000   4.00000   4.00000   4.00000   4.00000   4.00000   4.00000
% 	5.00000   5.00000   5.00000   5.00000   5.00000   5.00000   5.00000
% 	Time_vh =
% 	0.25000   0.25000   0.25000   0.25000   0.25000   0.25000   0.25000
% 	0.75000   0.75000   0.75000   0.75000   0.75000   0.75000   0.75000
% 	1.25000   1.25000   1.25000   1.25000   1.25000   1.25000   1.25000
% 	1.75000   1.75000   1.75000   1.75000   1.75000   1.75000   1.75000
% 	2.50000   2.50000   2.50000   2.50000   2.50000   2.50000   2.50000
% 	3.50000   3.50000   3.50000   3.50000   3.50000   3.50000   3.50000
% 	4.50000   4.50000   4.50000   4.50000   4.50000   4.50000   4.50000
% <=ExampleEND
% %}
%Create Time_M、xx、TT
	A        = 0:n-1;
	B        = ones(1,m);
	C        = B'*A;
	D        = reshape(C,m*n,1);
	F        = n:ultra_age;
	Timeline = [D' F]';
	x        = 0:size(Timeline)-1;
	[xx TT]  = meshgrid(x,Timeline);               %創造xx(age),TT(policy year)兩個維度
	Time_M   = (xx+TT);                            %年齡Matrix
	
%Create Time_v、Time_vh
	Time_v  = cumsum((TT<n)/m+(TT>=n));            %期未Discount的time
	BB      = Time_v-(TT<n)/(2*m);                 %繳費期間內，會有分期
	Time_vh = BB -(TT>=n)/2;                       %期中Discount的time

%Create Time_m
	Temp_a = 1:m;
	Temp_b = repmat(Temp_a',1,n);
	Temp_c = reshape(Temp_b,prod(size(Temp_b)),1);
	Temp_d = ones(ultra_age-n+1,1);
	Temp_e = [Temp_c;Temp_d];
	Time_m = std_v2m(Temp_e);
end
